In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
# import csv file and create dataframe as df
df=pd.read_csv('full_data_cleaning_practice_dataset.csv').copy()

In [3]:
df.head(3)
# top 3 rows

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1072.0,sara,200.0,abc@,12345,13-04-2023,2024.07.09,NaN,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1016.0,RAHUL,NaN,user@domain,99999abc,2024.03.11,03-11-2024,PUNE,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1008.0,NaN,200.0,abc@,9876543210,2023/09/28,01/20/2024,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN

In [4]:
df.info()
# dataframe information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1038 non-null   float64
 1   customer_name     832 non-null    object
 2   customer_age      871 non-null    float64
 3   email             808 non-null    object
 4   phone             779 non-null    object
 5   order_date        1050 non-null   object
 6   shipping_date     1049 non-null   object
 7   city              844 non-null    object
 8   state             797 non-null    object
 9   sales_amount      888 non-null    float64
 10  quantity          873 non-null    float64
 11  discount_percent  838 non-null    float64
 12  payment_mode      821 non-null    object
 13  is_returned       820 non-null    object
 14  product_category  840 non-null    object
dtypes: float64(5), object(10)
memory usage: 123.2+ KB

In [5]:
df.duplicated().sum()
# sum of duplicates

np.int64(50)

In [6]:
df=df.drop_duplicates()
# drop duplicates

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          990 non-null    float64
 1   customer_name     790 non-null    object
 2   customer_age      835 non-null    float64
 3   email             769 non-null    object
 4   phone             743 non-null    object
 5   order_date        1000 non-null   object
 6   shipping_date     999 non-null    object
 7   city              802 non-null    object
 8   state             758 non-null    object
 9   sales_amount      845 non-null    float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: float64(5), object(10)
memory usage: 125.0+ KB

In [8]:
df.duplicated(subset='order_id').sum()
# sum of order_id column duplicates

np.int64(899)

In [9]:
df.loc[df['order_id']==1002]
# 1002 Order_Id Total Rows check

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
262,1002.0,sara,-5.0,NaN,NaN,02-09-2024,29-09-2024,Chennai,Maharashtra,NaN,5.0,10.0,NetBanking,N,Clothing
445,1002.0,sara,30.0,abc@,99999abc,2023-04-06,09/25/2024,PUNE,Maharashtra,NaN,NaN,0.0,card,Yes,Grocery
520,1002.0,Anita,35.0,abc@,12345,2024-08-27,11/14/2023,NaN,Delhi,1000.0,-1.0,10.0,NaN,Y,electronics
567,1002.0,NaN,30.0,user@domain,NaN,30-03-2024,05/24/2024,NaN,Delhi,1000.0,5.0,10.0,NetBanking,NaN,electronics
616,1002.0,RAHUL,30.0,NaN,99999abc,2024/10/09,2024.03.07,mumbai,Tamil Nadu,100.0,NaN,NaN,NaN,NaN,Electronics
634,1002.0,Amit,25.0,test@gmail.com,9876543210,12/14/2024,2024-10-31,Delhi,Tamil Nadu,9999999.0,-1.0,5.0,Cash,Yes,NaN
837,1002.0,Amit,-5.0,user@domain,NaN,2024/06/17,04-01-2024,PUNE,Maharashtra,1000.0,1.0,10.0,Cash,No,electronics
866,1002.0,Anita,35.0,abc@,99999abc,2024/12/19,2024.04.20,PUNE,Tamil Nadu,9999999.0,5.0,0.0,UPI,No,electronics
873,1002.0,NaN,-5.0,test@gmail.com,9876543210,01/28/2023,01/27/2023,Chennai,Delhi,100.0,1.0,0.0,UPI,Y,Grocery
976,1002.0,Anita,-5.0,user@domain,9876543210,23-04-2023,2024.04.20,PUNE,Delhi,1000.0,NaN,10.0,Cash,NaN,Clothing

In [10]:
df = df.reset_index(drop=True)
# drop all indexes
df['order_id'] = np.arange(1000, 1000 + len(df))
# New Order id 1000 to 2000

In [11]:
df['order_id'].duplicated().sum()

np.int64(0)

In [12]:
df['order_id'].isnull().sum()

np.int64(0)

In [13]:
df['order_id']=df['order_id'].astype(int)
# type float to integer

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     790 non-null    object
 2   customer_age      835 non-null    float64
 3   email             769 non-null    object
 4   phone             743 non-null    object
 5   order_date        1000 non-null   object
 6   shipping_date     999 non-null    object
 7   city              802 non-null    object
 8   state             758 non-null    object
 9   sales_amount      845 non-null    float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: float64(4), int64(1), object(10)
memory usage: 117.3+ KB

In [15]:
df['customer_name'].isnull().sum()

np.int64(210)

In [16]:
df['customer_name']=df['customer_name'].str.strip().str.title()
# space remove and first letter capital

In [17]:
df['customer_name']=df['customer_name'].fillna('Unknown')
# fill NaN to 'Unknown'

In [18]:
df.head()

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,200.0,abc@,12345,13-04-2023,2024.07.09,NaN,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,NaN,user@domain,99999abc,2024.03.11,03-11-2024,PUNE,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,200.0,abc@,9876543210,2023/09/28,01/20/2024,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30.0,user@domain,NaN,2023-04-17,05/26/2023,mumbai,Maharashtra,NaN,1.0,0.0,card,NaN,Grocery
4,1004,Rahul,-5.0,user@domain,99999abc,03/13/2023,2024/06/09,Chennai,NaN,-300.0,2.0,110.0,NaN,N,Electronics

In [19]:
df['customer_age'].isnull().sum()

np.int64(165)

In [20]:
df['customer_age']=df['customer_age'].fillna(0)

In [21]:
df.loc[(df['customer_age']<1)|(df['customer_age']>100),'customer_age']=0
# Customer age can proceed from 1 to 100. Otherwise proceed from 0.

In [22]:
df['customer_age']=df['customer_age'].astype(int).copy()
# conver to integer

In [23]:
df.head()

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,abc@,12345,13-04-2023,2024.07.09,NaN,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,0,user@domain,99999abc,2024.03.11,03-11-2024,PUNE,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,0,abc@,9876543210,2023/09/28,01/20/2024,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30,user@domain,NaN,2023-04-17,05/26/2023,mumbai,Maharashtra,NaN,1.0,0.0,card,NaN,Grocery
4,1004,Rahul,0,user@domain,99999abc,03/13/2023,2024/06/09,Chennai,NaN,-300.0,2.0,110.0,NaN,N,Electronics

In [24]:
df['email']

0                abc@
1         user@domain
2                abc@
3         user@domain
4         user@domain
            ...
995               NaN
996               NaN
997    test@gmail.com
998    test@gmail.com
999    test@gmail.com
Name: email, Length: 1000, dtype: object

In [25]:
pattern = r'^[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,}$'
# create email pattern

In [26]:
df.loc[~df['email'].str.match(pattern, na=False), 'email'] = np.nan
# check email true or not.if not true fill NaN

In [27]:
df['email'] = df['email'].str.strip().str.lower()
# remove space and convert to lower case

In [28]:
df['email'] = df['email'].fillna('unknown@email.com')
# Fill in the non-email address with 'unknown@email.com'

In [29]:
df.head()

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,12345,13-04-2023,2024.07.09,NaN,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,0,unknown@email.com,99999abc,2024.03.11,03-11-2024,PUNE,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023/09/28,01/20/2024,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,NaN,2023-04-17,05/26/2023,mumbai,Maharashtra,NaN,1.0,0.0,card,NaN,Grocery
4,1004,Rahul,0,unknown@email.com,99999abc,03/13/2023,2024/06/09,Chennai,NaN,-300.0,2.0,110.0,NaN,N,Electronics

In [30]:
pattern = r'^[0-9]{10}$'

In [31]:
df.loc[~df['phone'].str.match(pattern, na=False), 'phone'] = np.nan

In [32]:
df['phone'] = df['phone'].astype('string')

df['phone'] = df['phone'].fillna('unknown')

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   object
 6   shipping_date     999 non-null    object
 7   city              802 non-null    object
 8   state             758 non-null    object
 9   sales_amount      845 non-null    float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: float64(3), int64(2), object(9), string(1)
memory usage: 117.3+ KB

In [34]:
df['order_date'] = df['order_date'].str.strip().copy()

In [35]:
df['order_date'] = df['order_date'].str.replace(r'[/.]', '-', regex=True)
# Replaced '/' and '.' with '-'

In [36]:
df.head(3)

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,13-04-2023,2024.07.09,NaN,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,03-11-2024,PUNE,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,01/20/2024,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN

In [37]:
df1=df[['order_id','order_date']].copy()
# Created a new dataframe DF1 and inserted the 'Order_Id' and 'Order_Date' columns from DF

In [38]:
df2=df[['order_id','order_date']].copy()
# Created a new dataframe DF2 and inserted the 'Order_Id' and 'Order_Date' columns from DF

In [39]:
df1['order_date']=df1['order_date'].str.strip()

In [40]:
df2['order_date']=df2['order_date'].str.strip()

In [41]:
df1

     order_id  order_date
0        1000  13-04-2023
1        1001  2024-03-11
2        1002  2023-09-28
3        1003  2023-04-17
4        1004  03-13-2023
..        ...         ...
995      1995  2024-10-03
996      1996  18-08-2024
997      1997  2023-11-17
998      1998  2023-11-15
999      1999  2024-09-04

[1000 rows x 2 columns]

In [42]:
df2

     order_id  order_date
0        1000  13-04-2023
1        1001  2024-03-11
2        1002  2023-09-28
3        1003  2023-04-17
4        1004  03-13-2023
..        ...         ...
995      1995  2024-10-03
996      1996  18-08-2024
997      1997  2023-11-17
998      1998  2023-11-15
999      1999  2024-09-04

[1000 rows x 2 columns]

In [43]:
df2['order_date'] = pd.to_datetime(
    df2['order_date'],
    errors='coerce',
    dayfirst=True
)
# Convert order_date column from object to datetime
# used dayfirst=True to handle mixed date formats
# To make invalid dates NaT errors='coerce'

In [44]:
df2

     order_id order_date
0        1000 2023-04-13
1        1001        NaT
2        1002        NaT
3        1003        NaT
4        1004        NaT
..        ...        ...
995      1995        NaT
996      1996 2024-08-18
997      1997        NaT
998      1998        NaT
999      1999        NaT

[1000 rows x 2 columns]

In [45]:
df1['order_date'] = pd.to_datetime(
    df1['order_date'].astype(str).str.strip(),
    format='%Y-%m-%d',
    errors='coerce'
)
# Convert order_date column from object to datetime
# used format='%Y-%m-%d' to handle mixed date formats
# To make invalid dates NaT errors='coerce'

In [46]:
df1

     order_id order_date
0        1000        NaT
1        1001 2024-03-11
2        1002 2023-09-28
3        1003 2023-04-17
4        1004        NaT
..        ...        ...
995      1995 2024-10-03
996      1996        NaT
997      1997 2023-11-17
998      1998 2023-11-15
999      1999 2024-09-04

[1000 rows x 2 columns]

In [47]:
df3 = (
    df1.merge(df2, on='order_id', how='outer', suffixes=('_df1', '_df2'))
       .assign(order_date=lambda x: x['order_date_df1'].combine_first(x['order_date_df2']))
       .drop(columns=['order_date_df1', 'order_date_df2'])
)
# Merge df1 and df2 on 'order_id' using outer join
# Create single 'order_date' column by taking df1 date first,
# and filling missing (NaT) values from df2
# Remove temporary date columns after merge

In [48]:
df3

     order_id order_date
0        1000 2023-04-13
1        1001 2024-03-11
2        1002 2023-09-28
3        1003 2023-04-17
4        1004        NaT
..        ...        ...
995      1995 2024-10-03
996      1996 2024-08-18
997      1997 2023-11-17
998      1998 2023-11-15
999      1999 2024-09-04

[1000 rows x 2 columns]

In [49]:
df3['order_date'].isnull().sum()

np.int64(143)

In [50]:
df3['order_date']=df3['order_date'].fillna('2000-01-01')

In [51]:
df3

     order_id order_date
0        1000 2023-04-13
1        1001 2024-03-11
2        1002 2023-09-28
3        1003 2023-04-17
4        1004 2000-01-01
..        ...        ...
995      1995 2024-10-03
996      1996 2024-08-18
997      1997 2023-11-17
998      1998 2023-11-15
999      1999 2024-09-04

[1000 rows x 2 columns]

In [52]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    1000 non-null   int64
 1   order_date  1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(1)
memory usage: 15.8 KB

In [53]:
df['order_date'] = df3['order_date']
# Replace df's order_date column with cleaned/merged order_date from df3

In [54]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024.07.09,NaN,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,03-11-2024,PUNE,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,01/20/2024,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,05/26/2023,mumbai,Maharashtra,NaN,1.0,0.0,card,NaN,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024/06/09,Chennai,NaN,-300.0,2.0,110.0,NaN,N,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,10-10-2023,NaN,Maharashtra,NaN,-1.0,110.0,NetBanking,N,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,03-08-2024,Delhi,Delhi,100.0,10.0,10.0,UPI,NaN,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,NaN,Maharashtra,500.0,10.0,110.0,card,Y,NaN
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024/02/26,mumbai,Maharashtra,1000.0,10.0,10.0,NaN,Yes,electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023/03/31,mumbai,Delhi,NaN,10.0,0.0,UPI,Yes,Grocery

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     999 non-null    object
 7   city              802 non-null    object
 8   state             758 non-null    object
 9   sales_amount      845 non-null    float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](1), float64(3), int64(2), object(8), string(1)
memory usage: 117.3+ KB

In [56]:
# Like Shame Order_Date
df['shipping_date'] = df['shipping_date'].str.strip()

In [57]:
df['shipping_date'] = df['shipping_date'].str.replace(r'[/.]', '-', regex=True)

In [58]:
df_shipping_date_1=df[['order_id','shipping_date']].copy()

In [59]:
df_shipping_date_2=df[['order_id','shipping_date']].copy()

In [60]:
df_shipping_date_1['shipping_date'] = df_shipping_date_1['shipping_date'].str.strip()

In [61]:
df_shipping_date_2['shipping_date'] = df_shipping_date_2['shipping_date'].str.strip()

In [62]:
df_shipping_date_1

     order_id shipping_date
0        1000    2024-07-09
1        1001    03-11-2024
2        1002    01-20-2024
3        1003    05-26-2023
4        1004    2024-06-09
..        ...           ...
995      1995    10-10-2023
996      1996    03-08-2024
997      1997    2023-08-13
998      1998    2024-02-26
999      1999    2023-03-31

[1000 rows x 2 columns]

In [63]:
df_shipping_date_2

     order_id shipping_date
0        1000    2024-07-09
1        1001    03-11-2024
2        1002    01-20-2024
3        1003    05-26-2023
4        1004    2024-06-09
..        ...           ...
995      1995    10-10-2023
996      1996    03-08-2024
997      1997    2023-08-13
998      1998    2024-02-26
999      1999    2023-03-31

[1000 rows x 2 columns]

In [64]:
df_shipping_date_2['shipping_date'] = pd.to_datetime(
    df_shipping_date_2['shipping_date'],
    format='%m-%d-%Y',
    errors='coerce'
)
# Convert shipping_date from object to datetime using MM-DD-YYYY format
# Invalid date values will be converted to NaT

In [65]:
df_shipping_date_2

     order_id shipping_date
0        1000           NaT
1        1001    2024-03-11
2        1002    2024-01-20
3        1003    2023-05-26
4        1004           NaT
..        ...           ...
995      1995    2023-10-10
996      1996    2024-03-08
997      1997           NaT
998      1998           NaT
999      1999           NaT

[1000 rows x 2 columns]

In [66]:
df_shipping_date_1['shipping_date'] = pd.to_datetime(
    df_shipping_date_1['shipping_date'].astype(str).str.strip(),
    format='%Y-%m-%d',
    errors='coerce'
)

In [67]:
df_shipping_date_1

     order_id shipping_date
0        1000    2024-07-09
1        1001           NaT
2        1002           NaT
3        1003           NaT
4        1004    2024-06-09
..        ...           ...
995      1995           NaT
996      1996           NaT
997      1997    2023-08-13
998      1998    2024-02-26
999      1999    2023-03-31

[1000 rows x 2 columns]

In [68]:
df_shipping_date_3 = (
    df_shipping_date_1.merge(df_shipping_date_2, on='order_id', how='outer', suffixes=('_df1', '_df2'))
       .assign(shipping_date=lambda x: x['shipping_date_df1'].combine_first(x['shipping_date_df2']))
       .drop(columns=['shipping_date_df1', 'shipping_date_df2'])
)

In [69]:
df_shipping_date_3

     order_id shipping_date
0        1000    2024-07-09
1        1001    2024-03-11
2        1002    2024-01-20
3        1003    2023-05-26
4        1004    2024-06-09
..        ...           ...
995      1995    2023-10-10
996      1996    2024-03-08
997      1997    2023-08-13
998      1998    2024-02-26
999      1999    2023-03-31

[1000 rows x 2 columns]

In [70]:
df_shipping_date_3['shipping_date'].isnull().sum()

np.int64(135)

In [71]:
df_shipping_date_3['shipping_date']=df_shipping_date_3['shipping_date'].fillna('2000-01-01')

In [72]:
df_shipping_date_3

     order_id shipping_date
0        1000    2024-07-09
1        1001    2024-03-11
2        1002    2024-01-20
3        1003    2023-05-26
4        1004    2024-06-09
..        ...           ...
995      1995    2023-10-10
996      1996    2024-03-08
997      1997    2023-08-13
998      1998    2024-02-26
999      1999    2023-03-31

[1000 rows x 2 columns]

In [73]:
df['shipping_date'] = df_shipping_date_3['shipping_date']

In [74]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024-07-09,NaN,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,2024-03-11,PUNE,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,2024-01-20,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,2023-05-26,mumbai,Maharashtra,NaN,1.0,0.0,card,NaN,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024-06-09,Chennai,NaN,-300.0,2.0,110.0,NaN,N,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,2023-10-10,NaN,Maharashtra,NaN,-1.0,110.0,NetBanking,N,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,2024-03-08,Delhi,Delhi,100.0,10.0,10.0,UPI,NaN,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,NaN,Maharashtra,500.0,10.0,110.0,card,Y,NaN
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024-02-26,mumbai,Maharashtra,1000.0,10.0,10.0,NaN,Yes,electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023-03-31,mumbai,Delhi,NaN,10.0,0.0,UPI,Yes,Grocery

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              802 non-null    object
 8   state             758 non-null    object
 9   sales_amount      845 non-null    float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(3), int64(2), object(7), string(1)
memory usage: 117.3+ KB

In [76]:
df['city']=df['city'].str.strip().str.title()

In [77]:
df['city']=df['city'].fillna('Unknown')

In [78]:
df['city'].isnull().sum()

np.int64(0)

In [79]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024-07-09,Unknown,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,2024-03-11,Pune,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,2024-01-20,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,2023-05-26,Mumbai,Maharashtra,NaN,1.0,0.0,card,NaN,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024-06-09,Chennai,NaN,-300.0,2.0,110.0,NaN,N,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,2023-10-10,Unknown,Maharashtra,NaN,-1.0,110.0,NetBanking,N,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,2024-03-08,Delhi,Delhi,100.0,10.0,10.0,UPI,NaN,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,Unknown,Maharashtra,500.0,10.0,110.0,card,Y,NaN
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024-02-26,Mumbai,Maharashtra,1000.0,10.0,10.0,NaN,Yes,electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023-03-31,Mumbai,Delhi,NaN,10.0,0.0,UPI,Yes,Grocery

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             758 non-null    object
 9   sales_amount      845 non-null    float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(3), int64(2), object(7), string(1)
memory usage: 117.3+ KB

In [81]:
df['state']=df['state'].str.strip().str.title()

In [82]:
df['state']=df['state'].fillna('Unknown')

In [83]:
df['state'].isnull().sum()

np.int64(0)

In [84]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024-07-09,Unknown,Tamil Nadu,9999999.0,NaN,10.0,NaN,Y,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,2024-03-11,Pune,Delhi,9999999.0,5.0,NaN,NaN,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,2024-01-20,Chennai,Delhi,500.0,-1.0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,2023-05-26,Mumbai,Maharashtra,NaN,1.0,0.0,card,NaN,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024-06-09,Chennai,Unknown,-300.0,2.0,110.0,NaN,N,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,2023-10-10,Unknown,Maharashtra,NaN,-1.0,110.0,NetBanking,N,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,2024-03-08,Delhi,Delhi,100.0,10.0,10.0,UPI,NaN,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,Unknown,Maharashtra,500.0,10.0,110.0,card,Y,NaN
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024-02-26,Mumbai,Maharashtra,1000.0,10.0,10.0,NaN,Yes,electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023-03-31,Mumbai,Delhi,NaN,10.0,0.0,UPI,Yes,Grocery

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      845 non-null    float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(3), int64(2), object(7), string(1)
memory usage: 117.3+ KB

In [86]:
df.loc[df['sales_amount']<0,'sales_amount']=0

In [87]:
df['sales_amount']=df['sales_amount'].fillna(0)

In [88]:
df['sales_amount'].isnull().sum()

np.int64(0)

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      1000 non-null   float64
 10  quantity          832 non-null    float64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(3), int64(2), object(7), string(1)
memory usage: 117.3+ KB

In [90]:
df.loc[df['quantity']<0,'quantity']=0

In [91]:
df['quantity']=df['quantity'].fillna(0)

In [92]:
df['quantity']=df['quantity'].astype(int)

In [93]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024-07-09,Unknown,Tamil Nadu,9999999.0,0,10.0,NaN,Y,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,2024-03-11,Pune,Delhi,9999999.0,5,NaN,NaN,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,2024-01-20,Chennai,Delhi,500.0,0,NaN,NetBanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,2023-05-26,Mumbai,Maharashtra,0.0,1,0.0,card,NaN,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024-06-09,Chennai,Unknown,0.0,2,110.0,NaN,N,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,2023-10-10,Unknown,Maharashtra,0.0,0,110.0,NetBanking,N,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,2024-03-08,Delhi,Delhi,100.0,10,10.0,UPI,NaN,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,Unknown,Maharashtra,500.0,10,110.0,card,Y,NaN
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024-02-26,Mumbai,Maharashtra,1000.0,10,10.0,NaN,Yes,electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023-03-31,Mumbai,Delhi,0.0,10,0.0,UPI,Yes,Grocery

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      1000 non-null   float64
 10  quantity          1000 non-null   int64
 11  discount_percent  799 non-null    float64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(2), int64(3), object(7), string(1)
memory usage: 117.3+ KB

In [95]:
df.loc[df['discount_percent'] > 100, 'discount_percent'] = np.nan
# 'discount_percent' greater than 100 made Naan

In [96]:
df['discount_percent']=df['discount_percent'].fillna(0)

In [97]:
df['discount_percent']=df['discount_percent'].astype(int)

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      1000 non-null   float64
 10  quantity          1000 non-null   int64
 11  discount_percent  1000 non-null   int64
 12  payment_mode      784 non-null    object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(4), object(7), string(1)
memory usage: 117.3+ KB

In [99]:
df['payment_mode'].head(50)

0            NaN
1            NaN
2     NetBanking
3           card
4            NaN
5           UPI
6           card
7           card
8            NaN
9            NaN
10           NaN
11          UPI
12          card
13    NetBanking
14          UPI
15          Cash
16           NaN
17          card
18          UPI
19          Cash
20          UPI
21          UPI
22    NetBanking
23    NetBanking
24          UPI
25          Cash
26          card
27          card
28           NaN
29           NaN
30          card
31          UPI
32          UPI
33    NetBanking
34    NetBanking
35           NaN
36          card
37          UPI
38          card
39          Cash
40          card
41          Cash
42    NetBanking
43    NetBanking
44           NaN
45          card
46          card
47          Cash
48    NetBanking
49          Cash
Name: payment_mode, dtype: object

In [100]:
df['payment_mode']=df['payment_mode'].str.strip().str.title()

In [101]:
df['payment_mode']=df['payment_mode'].fillna('Unknown')

In [102]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024-07-09,Unknown,Tamil Nadu,9999999.0,0,10,Unknown,Y,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,2024-03-11,Pune,Delhi,9999999.0,5,0,Unknown,NaN,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,2024-01-20,Chennai,Delhi,500.0,0,0,Netbanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,2023-05-26,Mumbai,Maharashtra,0.0,1,0,Card,NaN,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024-06-09,Chennai,Unknown,0.0,2,0,Unknown,N,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,2023-10-10,Unknown,Maharashtra,0.0,0,0,Netbanking,N,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,2024-03-08,Delhi,Delhi,100.0,10,10,Upi,NaN,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,Unknown,Maharashtra,500.0,10,0,Card,Y,NaN
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024-02-26,Mumbai,Maharashtra,1000.0,10,10,Unknown,Yes,electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023-03-31,Mumbai,Delhi,0.0,10,0,Upi,Yes,Grocery

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      1000 non-null   float64
 10  quantity          1000 non-null   int64
 11  discount_percent  1000 non-null   int64
 12  payment_mode      1000 non-null   object
 13  is_returned       781 non-null    object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(4), object(7), string(1)
memory usage: 117.3+ KB

In [104]:
df['is_returned'].head(50)

0       Y
1     NaN
2     Yes
3     NaN
4       N
5     NaN
6     Yes
7     NaN
8       Y
9      No
10      Y
11     No
12    NaN
13      N
14    NaN
15    Yes
16    NaN
17     No
18      Y
19      N
20    NaN
21    NaN
22      Y
23      N
24    NaN
25    NaN
26     No
27     No
28    Yes
29      Y
30      N
31    NaN
32    NaN
33    Yes
34    NaN
35      Y
36    Yes
37      Y
38    Yes
39    NaN
40    Yes
41     No
42      N
43    NaN
44      N
45    NaN
46      N
47     No
48      N
49    Yes
Name: is_returned, dtype: object

In [105]:
df['is_returned']=df['is_returned'].str.strip().str.title()

In [106]:
df['is_returned']=df['is_returned'].fillna('Unknown')

In [107]:
df['is_returned']=df['is_returned'].replace('Y','Yes')
# 'Y' convert to 'Yes'

In [108]:
df['is_returned']=df['is_returned'].replace('N','No')
# 'N' convert to 'No'

In [109]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024-07-09,Unknown,Tamil Nadu,9999999.0,0,10,Unknown,Yes,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,2024-03-11,Pune,Delhi,9999999.0,5,0,Unknown,Unknown,electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,2024-01-20,Chennai,Delhi,500.0,0,0,Netbanking,Yes,NaN
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,2023-05-26,Mumbai,Maharashtra,0.0,1,0,Card,Unknown,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024-06-09,Chennai,Unknown,0.0,2,0,Unknown,No,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,2023-10-10,Unknown,Maharashtra,0.0,0,0,Netbanking,No,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,2024-03-08,Delhi,Delhi,100.0,10,10,Upi,Unknown,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,Unknown,Maharashtra,500.0,10,0,Card,Yes,NaN
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024-02-26,Mumbai,Maharashtra,1000.0,10,10,Unknown,Yes,electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023-03-31,Mumbai,Delhi,0.0,10,0,Upi,Yes,Grocery

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      1000 non-null   float64
 10  quantity          1000 non-null   int64
 11  discount_percent  1000 non-null   int64
 12  payment_mode      1000 non-null   object
 13  is_returned       1000 non-null   object
 14  product_category  796 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(4), object(7), string(1)
memory usage: 117.3+ KB

In [111]:
df['product_category'].head(50)

0          Clothing
1      electronics
2               NaN
3           Grocery
4       Electronics
5           Grocery
6               NaN
7           Grocery
8      electronics
9          Clothing
10          Grocery
11         Clothing
12              NaN
13         Clothing
14          Grocery
15          Grocery
16      Electronics
17          Grocery
18         Clothing
19      Electronics
20          Grocery
21          Grocery
22              NaN
23      Electronics
24              NaN
25              NaN
26              NaN
27     electronics
28              NaN
29         Clothing
30          Grocery
31     electronics
32              NaN
33          Grocery
34      Electronics
35      Electronics
36          Grocery
37         Clothing
38          Grocery
39          Grocery
40     electronics
41      Electronics
42      Electronics
43              NaN
44          Grocery
45          Grocery
46         Clothing
47      Electronics
48         Clothing
49     electronics
Name: product_category, dtype: object

In [112]:
df['product_category']=df['product_category'].str.strip().str.title()

In [113]:
df['product_category']=df['product_category'].fillna('Unknown')

In [114]:
df

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category
0,1000,Sara,0,unknown@email.com,unknown,2023-04-13,2024-07-09,Unknown,Tamil Nadu,9999999.0,0,10,Unknown,Yes,Clothing
1,1001,Rahul,0,unknown@email.com,unknown,2024-03-11,2024-03-11,Pune,Delhi,9999999.0,5,0,Unknown,Unknown,Electronics
2,1002,Unknown,0,unknown@email.com,9876543210,2023-09-28,2024-01-20,Chennai,Delhi,500.0,0,0,Netbanking,Yes,Unknown
3,1003,Amit,30,unknown@email.com,unknown,2023-04-17,2023-05-26,Mumbai,Maharashtra,0.0,1,0,Card,Unknown,Grocery
4,1004,Rahul,0,unknown@email.com,unknown,2000-01-01,2024-06-09,Chennai,Unknown,0.0,2,0,Unknown,No,Electronics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,1995,Anita,30,unknown@email.com,unknown,2024-10-03,2023-10-10,Unknown,Maharashtra,0.0,0,0,Netbanking,No,Clothing
996,1996,Rahul,0,unknown@email.com,unknown,2024-08-18,2024-03-08,Delhi,Delhi,100.0,10,10,Upi,Unknown,Grocery
997,1997,Amit,30,test@gmail.com,unknown,2023-11-17,2023-08-13,Unknown,Maharashtra,500.0,10,0,Card,Yes,Unknown
998,1998,Unknown,0,test@gmail.com,unknown,2023-11-15,2024-02-26,Mumbai,Maharashtra,1000.0,10,10,Unknown,Yes,Electronics
999,1999,Unknown,0,test@gmail.com,unknown,2024-09-04,2023-03-31,Mumbai,Delhi,0.0,10,0,Upi,Yes,Grocery

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      1000 non-null   float64
 10  quantity          1000 non-null   int64
 11  discount_percent  1000 non-null   int64
 12  payment_mode      1000 non-null   object
 13  is_returned       1000 non-null   object
 14  product_category  1000 non-null   object
dtypes: datetime64[ns](2), float64(1), int64(4), object(7), string(1)
memory usage: 117.3+ KB

In [116]:
df.isna().sum()
# check all columns none or not none

order_id            0
customer_name       0
customer_age        0
email               0
phone               0
order_date          0
shipping_date       0
city                0
state               0
sales_amount        0
quantity            0
discount_percent    0
payment_mode        0
is_returned         0
product_category    0
dtype: int64

In [117]:
df.duplicated().sum()

np.int64(0)

In [118]:
df[(df['discount_percent'] < 0) | (df['discount_percent'] > 100)]
# check 0< 'discount_percent'>100

Empty DataFrame
Columns: [order_id, customer_name, customer_age, email, phone, order_date, shipping_date, city, state, sales_amount, quantity, discount_percent, payment_mode, is_returned, product_category]
Index: []

In [119]:
df[df['sales_amount'] < 0]
# check 'sales_amount'>0

Empty DataFrame
Columns: [order_id, customer_name, customer_age, email, phone, order_date, shipping_date, city, state, sales_amount, quantity, discount_percent, payment_mode, is_returned, product_category]
Index: []

In [120]:
df['order_date'].min()
df['order_date'].max()
# Validate date range:
# - Find minimum (earliest) order date
# - Find maximum (latest) order date
# Used to check unrealistic or future dates

Timestamp('2024-12-30 00:00:00')

In [121]:
df['order_id'].nunique() == len(df)
# check order_id unique or not

True

In [122]:
df.describe()
# Perform exploratory data analysis (EDA):
# Generate descriptive statistics (count, mean, std, min, max) for numeric columns
df.describe()
df.groupby('city')['sales_amount'].sum().sort_values(ascending=False)
# Aggregate total sales by city and rank cities by highest revenue

city
Mumbai     420071158.0
Unknown    380050462.0
Pune       340049266.0
Delhi      270058973.0
Chennai    240051376.0
Name: sales_amount, dtype: float64

In [123]:
df['month'] = df['order_date'].dt.to_period('M')
df.groupby('month')['sales_amount'].sum().sort_values(ascending=False)

month
2000-01    280036072.0
2024-07     90012591.0
2024-10     90012391.0
2023-09     90011891.0
2023-08     90011591.0
2024-02     80007992.0
2023-01     80005392.0
2024-05     70011893.0
2024-01     70008093.0
2023-04     60010294.0
2023-05     60008694.0
2024-11     50016595.0
2024-04     50013295.0
2024-06     50011795.0
2023-03     50010995.0
2024-08     50008495.0
2023-10     50007395.0
2023-06     40013996.0
2023-12     40013596.0
2023-02     40012496.0
2024-12     40009796.0
2024-09     40009096.0
2024-03     30007097.0
2023-07     30005097.0
2023-11     30004597.0
Freq: M, Name: sales_amount, dtype: float64

In [124]:
df.groupby('customer_name')['sales_amount'].sum().sort_values(ascending=False).head()

customer_name
Unknown    390055461.0
Anita      360060864.0
Sara       340056466.0
Rahul      300051870.0
Amit       260056574.0
Name: sales_amount, dtype: float64

In [125]:
df.info()
df.isna().sum()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   int64
 1   customer_name     1000 non-null   object
 2   customer_age      1000 non-null   int64
 3   email             1000 non-null   object
 4   phone             1000 non-null   string
 5   order_date        1000 non-null   datetime64[ns]
 6   shipping_date     1000 non-null   datetime64[ns]
 7   city              1000 non-null   object
 8   state             1000 non-null   object
 9   sales_amount      1000 non-null   float64
 10  quantity          1000 non-null   int64
 11  discount_percent  1000 non-null   int64
 12  payment_mode      1000 non-null   object
 13  is_returned       1000 non-null   object
 14  product_category  1000 non-null   object
 15  month             1000 non-null   period[M]
dtypes: datetime64[ns](2), float64(1), int64(4), object(7), period[M](1), string(1)
memory usage: 125.1+ KB

,order_id,customer_name,customer_age,email,phone,order_date,shipping_date,city,state,sales_amount,quantity,discount_percent,payment_mode,is_returned,product_category,month
count,1000.000000,1000,1000.000000,1000,1000,1000,1000,1000,1000,1.000000e+03,1000.000000,1000.000000,1000,1000,1000,1000
unique,NaN,5,NaN,2,2,NaN,NaN,5,4,NaN,NaN,NaN,5,3,4,25
top,NaN,Anita,NaN,unknown@email.com,unknown,NaN,NaN,Mumbai,Maharashtra,NaN,NaN,NaN,Unknown,No,Electronics,2000-01
freq,NaN,222,NaN,725,775,NaN,NaN,226,255,NaN,NaN,NaN,216,403,397,143
mean,1499.500000,NaN,14.610000,NaN,NaN,2020-07-21 17:26:52.800000,2020-09-25 03:51:50.400000,NaN,NaN,1.650281e+06,2.929000,2.855000,NaN,NaN,NaN,NaN
min,1000.000000,NaN,0.000000,NaN,NaN,2000-01-01 00:00:00,2000-01-01 00:00:00,NaN,NaN,0.000000e+00,0.000000,0.000000,NaN,NaN,NaN,NaN
25%,1249.750000,NaN,0.000000,NaN,NaN,2023-03-26 06:00:00,2023-03-30 00:00:00,NaN,NaN,0.000000e+00,0.000000,0.000000,NaN,NaN,NaN,NaN
50%,1499.500000,NaN,0.000000,NaN,NaN,2023-10-11 00:00:00,2023-10-19 12:00:00,NaN,NaN,5.000000e+02,1.000000,0.000000,NaN,NaN,NaN,NaN
75%,1749.250000,NaN,30.000000,NaN,NaN,2024-05-26 00:00:00,2024-05-19 00:00:00,NaN,NaN,1.000000e+03,5.000000,5.000000,NaN,NaN,NaN,NaN
max,1999.000000,NaN,35.000000,NaN,NaN,2024-12-30 00:00:00,2024-12-30 00:00:00,NaN,NaN,9.999999e+06,10.000000,10.000000,NaN,NaN,NaN,NaN
std,288.819436,NaN,15.260432,NaN,NaN,NaN,NaN,NaN,NaN,3.713537e+06,3.527663,3.979926,NaN,NaN,NaN,NaN

In [126]:
df.to_csv('clean_sales_data.csv')